In [1]:
import pandas as pd

In [2]:
# merging ot concateating datasets

In [3]:
import pandas as pd

In [4]:
staff=pd.DataFrame([
    {"name":"gokul","role":"hr"},
    {"name":"hari","role":"pr"},
    {"name":"sr","role":"pune"}
])

In [5]:
staff

    name  role
0  gokul    hr
1   hari    pr
2     sr  pune

In [6]:
staff=staff.set_index('name')
student=student.set_index('name')

In [7]:
staff

       role
name
gokul    hr
hari     pr
sr     pune

In [8]:
student=pd.DataFrame([
    {"name":"gokul","role":"hr"},
    {"name":"sjsjsjj","role":"prlsls"},
    {"name":"sraa","role":"klklkl"}
])

In [9]:
student=student.set_index('name')

In [10]:
student

           role
name
gokul        hr
sjsjsjj  prlsls
sraa     klklkl

In [11]:
pd.merge(staff,student,how="outer",left_index=True,right_index=True)#full outer join in similiar to union

        role_x  role_y
name
gokul       hr      hr
hari        pr     NaN
sjsjsjj    NaN  prlsls
sr        pune     NaN
sraa       NaN  klklkl

In [12]:
# now we want to get th e intersection set the how attribute to inner
pd.merge(staff,student,how="inner",left_index=True,right_index=True)#full outer join in similiar to union

      role_x role_y
name
gokul     hr     hr

In [13]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj1 = pd.Series(sdata)
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj2 = pd.Series(sdata, index=states)
obj3 = pd.isnull(obj2)

In [14]:
x=obj2['California']
obj2['California']==x

False

In [15]:
import pandas as pd
d = {
    '1': 'Alice',
    '2': 'Bob',
    '3': 'Rita',
    '4': 'Molly',
    '5': 'Ryan'
}
S = pd.Series(d)

In [16]:
S.iloc[0:3]

1    Alice
2      Bob
3     Rita
dtype: object

In [17]:
df=staff.copy()

In [18]:
df=df.reset_index()
df.columns

Index(['name', 'role'], dtype='object')

In [23]:
df=df.rename(mapper=lambda x: x.upper(),axis="columns" )
df

    NAME  ROLE
0  gokul    hr
1   hari    pr
2     sr  pune

In [30]:
df['score']=[10,20,1010]

In [31]:
df

    NAME  ROLE  score
0  gokul    hr     10
1   hari    pr     20
2     sr  pune   1010

In [33]:
df[df['score']>10]

   NAME  ROLE  score
1  hari    pr     20
2    sr  pune   1010

In [36]:
df.where(df['score']>10)

   NAME  ROLE   score
0   NaN   NaN     NaN
1  hari    pr    20.0
2    sr  pune  1010.0

In [39]:
df.drop('score',axis=1)
df

    NAME  ROLE  score
0  gokul    hr     10
1   hari    pr     20
2     sr  pune   1010

In [47]:
df=df.set_index('NAME')

KeyError: "None of ['NAME'] are in the columns"

In [48]:
df

       ROLE  score
NAME
gokul    hr     10
hari     pr     20
sr     pune   1010

In [52]:
df.drop(['gokul','hari'])

      ROLE  score
NAME
sr    pune   1010

In [54]:
import pandas as pd
s1 = pd.Series({1: 'Alice', 2: 'Jack', 3: 'Molly'})
s2 = pd.Series({'Alice': 1, 'Jack': 2, 'Molly': 3})

In [55]:
df

       ROLE  score
NAME
gokul    hr     10
hari     pr     20
sr     pune   1010

In [62]:
df.T['gokul']

ROLE     hr
score    10
Name: gokul, dtype: object

In [66]:
score=pd.DataFrame(
)

In [67]:
score

          tofel score
gre score         NaN

In [68]:
s2

Alice    1
Jack     2
Molly    3
dtype: int64

In [71]:
for i in s2.iteritems():
    print(i)

('Alice', 1)
('Jack', 2)
('Molly', 3)

In [72]:
s1

1    Alice
2     Jack
3    Molly
dtype: object

In [73]:
s2

Alice    1
Jack     2
Molly    3
dtype: int64

In [75]:
s2=s1.append(s2)

In [76]:
staff=pd.DataFrame([
    {"name":"gokul","role":"hr"},
    {"name":"hari","role":"pr"},
    {"name":"sr","role":"pune"}
])
student=pd.DataFrame([
    {"name":"gokul","role":"hr"},
    {"name":"sjsjsjj","role":"prlsls"},
    {"name":"sraa","role":"klklkl"}
])
staff=staff.set_index('name')
student=student.set_index('name')
pd.merge(staff,student,how="outer",left_index=True,right_index=True)#full outer join in similiar to union

        role_x  role_y
name
gokul       hr      hr
hari        pr     NaN
sjsjsjj    NaN  prlsls
sr        pune     NaN
sraa       NaN  klklkl

In [77]:
# left join 
# always left is first and right is second

In [79]:
pd.merge(staff,student,how="left",left_index=True,right_index=True)

      role_x role_y
name
gokul     hr     hr
hari      pr    NaN
sr      pune    NaN

In [80]:
staff

       role
name
gokul    hr
hari     pr
sr     pune

In [82]:
staff=staff.reset_index()
student=student.reset_index()